In [1]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name":['pooja', 'priya', 'poonam', 'nayan'],
    "age":[22,19,17,13],
    "city":['vikhroli','mulund','ulhasnagar','thane']
}

In [5]:
df = pd.DataFrame(dict1)

In [6]:
df

     name  age        city
0   pooja   22    vikhroli
1   priya   19      mulund
2  poonam   17  ulhasnagar
3   nayan   13       thane

In [7]:
df.to_csv('friends.csv')

In [8]:
df.to_csv('friends_no_index.csv', index = False)

In [9]:
df.head(2)

    name  age      city
0  pooja   22  vikhroli
1  priya   19    mulund

In [10]:
df.tail(2)

     name  age        city
2  poonam   17  ulhasnagar
3   nayan   13       thane

In [12]:
df.describe()

             age
count   4.000000
mean   17.750000
std     3.774917
min    13.000000
25%    16.000000
50%    18.000000
75%    19.750000
max    22.000000